
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.Событие.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

	ПараметрыФормы = Новый Структура("Контрагент", ПараметрКоманды);
	ПараметрыВыполненияКоманды = Новый Структура ("Отбор", ПараметрыФормы);
	ОткрытьФорму("Документ.Событие.ФормаСписка", ПараметрыВыполненияКоманды, , ПараметрКоманды);
КонецПроцедуры
