
&НаКлиенте
Процедура ПоказыватьПомеченныхНаУдаление(Команда)

    ПоказыватьПомеченныхНаУдаление = Не ПоказыватьПомеченныхНаУдаление;
	УстановитьОтборПомеченныхНаУдаление();
	Элементы.ФормаПоказыватьПомеченныхНаУдаление.Пометка = ПоказыватьПомеченныхНаУдаление;
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОтборПомеченныхНаУдаление()
	
	НастройкиСписка = Список.КомпоновщикНастроек.Настройки.Отбор;
	ПолеОтбора = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ТипПоляОтбора = Тип("ЭлементОтбораКомпоновкиДанных");
	
	ОтборПоПометкеУдаления = Неопределено;
	Для Каждого ЭлементОтбора Из НастройкиСписка.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора Тогда
			ОтборПоПометкеУдаления = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборПоПометкеУдаления = Неопределено Тогда
		ОтборПоПометкеУдаления = НастройкиСписка.Элементы.Добавить(ТипПоляОтбора);
		ОтборПоПометкеУдаления.ЛевоеЗначение = ПолеОтбора;
		ОтборПоПометкеУдаления.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоПометкеУдаления.ПравоеЗначение = Ложь;
		ОтборПоПометкеУдаления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	ОтборПоПометкеУдаления.Использование = Не ПоказыватьПомеченныхНаУдаление;
	
КонецПроцедуры