Процедура ПриНачалеРаботыСистемы() Экспорт

    СтараяВерсия = Константы.ВерсияКонфигурации.Получить();
	НоваяВерсия = Метаданные.Версия;
	
	Если СтараяВерсия = НоваяВерсия Тогда
		Возврат;
	КонецЕсли;

	ПриИзмененииВерсии(СтараяВерсия, НоваяВерсия);
	
КонецПроцедуры

Процедура ПриИзмененииВерсии(СтараяВерсия, НоваяВерсия)
	
	Константы.ВерсияКонфигурации.Установить(НоваяВерсия);
	
	Если СтараяВерсия < "1.0.0.1" И НоваяВерсия >= "1.0.0.1" Тогда
		 Справочники.ВидыКонтактнойИнформации.ЗаполнитьПредопределенныеЭлементы();
	КонецЕсли;   
	 
	Если СтараяВерсия < "1.0.0.2" И НоваяВерсия >= "1.0.0.2" Тогда
		 Справочники.Контрагенты.ЗаполнитьТабличнуюЧастьКонтактнаяИнформация();
	КонецЕсли;

	
КонецПроцедуры