
Процедура СформироватьПрайслист(ТабличныйДокумент, Ссылки) Экспорт
	
	Макет = ПолучитьМакет("ПрайсЛист");
	
	// Получаем область заголовка
	//ТабличнаяЧастьЗаголовок = Макет.ПолучитьОбласть("ТабличнаяЧастьЗаголовок");
	ТабличнаяЧастьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабличныйДокумент.Вывести(ТабличнаяЧастьЗаголовок);

	// Получаем область шапки и макета по имени
	Шапка = Макет.ПолучитьОбласть("Шапка");
	// Заполняем параметр Дата
	Шапка.Параметры.Дата = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	// Выводим область в документ
	ТабличныйДокумент.Вывести(Шапка);
	
	// Получаем область строк для формирования табличной части в цикле
	ТабличнаяЧастьСтрока = Макет.ПолучитьОбласть("Номенклатура");
	
	Для каждого СсылкаНоменклатура из Ссылки Цикл
		ТабличнаяЧастьСтрока.Параметры.Номенклатура = СсылкаНоменклатура; 
		ТабличнаяЧастьСтрока.Параметры.Цена = ПолучитьЦенуНоменклатуры(СсылкаНоменклатура); 
		ТабличныйДокумент.Вывести(ТабличнаяЧастьСтрока);
	КонецЦикла;
	        
КонецПроцедуры

Функция ПолучитьЦенуНоменклатуры(СсылкаНоменклатура)
	
	Отбор = Новый Структура("Номенклатура", СсылкаНоменклатура);
	ПоследняяЗапись = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	Возврат ПоследняяЗапись.Цена;
	
КонецФункции