

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьПрайслистНаСервере(ТабличныйДокумент, ПараметрКоманды);
	
	// Отключим отображение сетки для более естественного отображения
	ТабличныйДокумент.ОтображатьСетку = Ложь;

	ТабличныйДокумент.Показать("ПрайсЛист");	
КонецПроцедуры

&НаСервере
Процедура СформироватьПрайслистНаСервере(ТабличныйДокумент, Ссылки) Экспорт

	// В принципе, обработку заполнения табличного документа можно описать тут,
	// но все таки, это действие уместнее разместить в модуле менеджера справочника, 
	// вызовем процедуру в нем
	Справочники.Номенклатура.СформироватьПрайслист(ТабличныйДокумент, Ссылки);
КонецПроцедуры