
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыборФайлаАсинхронно();
КонецПроцедуры


&НаКлиенте
Асинх Процедура ВыборФайлаАсинхронно()
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "ВыберитеФайл";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Фильтр = "Все файлы|*.*|Текстовые файлы|*.csv";
	ДиалогВыбора.ИндексФильтра = 1;
	ДиалогВыбора.Каталог = "C:\";
	
	РезультатВыбора = Ждать ДиалогВыбора.ВыбратьАсинх();
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПутьКФайлу = РезультатВыбора[0];
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПрочитатьВBase64(Команда)
	
	// Проверка заполнения пути к файлу
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Нужно указать Путь к файлу");
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);
	ПреобразованныеДанные = Base64Строка(ДвоичныеДанныеФайла);
	
	СтрокаBase64 = ПреобразованныеДанные;

	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьВBase64(Команда)

	// Проверка наличия данных для сохранения
	Если НЕ ЗначениеЗаполнено(СтрокаBase64) Тогда
		Сообщить("Нужно заполнить 'Строка Base64'");
		Возврат;
	КонецЕсли;
	
	ПреобразованныеДанные = СтрокаBase64;
	ЗначениеОбратно = Base64Значение(ПреобразованныеДанные);
	СтрокаBase64 = ЗначениеОбратно;
	
	ЗначениеОбратно.Записать(ПутьКФайлу);
КонецПроцедуры


