
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ОтборСтрок = Новый Структура("Номенклатура", Значение);
	НайденныеСтрокиВСпискеВыбранных = СписокВыбранныхЭлементов.НайтиСтроки(ОтборСтрок);

	Если НайденныеСтрокиВСпискеВыбранных.Количество() = 0 Тогда

		НоваяСтрокаТаблицы = СписокВыбранныхЭлементов.Добавить();
		НоваяСтрокаТаблицы.Номенклатура = Значение;
		НоваяСтрокаТаблицы.Количество = 1;

	Иначе

		НайденнаяСтрока = НайденныеСтрокиВСпискеВыбранных[0];
		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)

	ВыбранныеДанные = Новый Массив;

	Для Каждого Строка Из СписокВыбранныхЭлементов Цикл                          
		// Создаем структуру с пустыми полями "Номенклатура" и "Количество"
		ОписаниеВыбранногоЗначения = Новый Структура("Номенклатура, Количество");

		//Заполняем поля структуры. Т.к. они одноименны полям таблицы, можно сделать это в одну строку
		ЗаполнитьЗначенияСвойств(ОписаниеВыбранногоЗначения, Строка);

		ВыбранныеДанные.Добавить(ОписаниеВыбранногоЗначения);
	КонецЦикла;

	ОповеститьОВыборе(ВыбранныеДанные);
	
КонецПроцедуры

