&НаСервере
Процедура СформироватьСтандартныеУпаковки() Экспорт
	
	//Получаем макет
	Макет = ПолучитьМакет("СтандартныеУпаковки");
	
	// Считываем макет построчно
	Для Сч = 1 по Макет.ВысотаТаблицы Цикл
		НаименованиеУпаковкиИзМакета = Макет.Область(Сч,1).Текст;
		ПроверкаНаименованияИзМакета = Справочники.Упаковки.НайтиПоНаименованию(НаименованиеУпаковкиИзМакета);
		
		Если НЕ ЗначениеЗаполнено(ПроверкаНаименованияИзМакета) Тогда
			
			// Создаем отсутствующие упаковки
			НоваяУпаковка = Справочники.Упаковки.СоздатьЭлемент();
			НоваяУпаковка.Наименование = НаименованиеУпаковкиИзМакета;
			НоваяУпаковка.Записать();
			
			// Проверка создания
			Если ЗначениеЗаполнено(НоваяУпаковка.Ссылка) Тогда
				Сообщить(СтрШаблон("Создана новая упаковка (%1)", НоваяУпаковка.Ссылка));
			Иначе Сообщить(СтрШаблон("Новая упаковка (%1) НЕ создана", НоваяУпаковка.Ссылка));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


