Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт

ТипАдрес = Перечисления.ТипыКонтактнойИнформации.Адрес; 

ПредопределенныйОбъект = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

//// На самом деле, так как мы находимся в модуле менеджера справочника ВидыКонтактнойИнформации,
//// можно не писать "Справочники.ВидыКонтактнойИнформации", мы и так в этом контексте.
ПредопределенныйОбъект = ПочтовыйАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
ПредопределенныйОбъект.Записать();

КонецПроцедуры