
&НаСервере
Процедура ПрочитатьГраницуНаСервере()
	
	Граница = Последовательности.СкладскиеДокументы.ПолучитьГраницу();
	ГраницаДата = Граница.Дата;
	ГраницаСсылка = Граница.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьГраницу(Команда)
	ПрочитатьГраницуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПоследовательностьНаСервере()
	
	Последовательности.СкладскиеДокументы.Восстановить();
	ПрочитатьГраницуНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	ВосстановитьПоследовательностьНаСервере();
КонецПроцедуры
