
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//ОткрытьФорму("Справочник.Сотрудники.ФормаСписка", , , , , );
	Отбор = новый Структура;
	Отбор.Вставить("Уволен", Истина);
	ПараметрыФормы = Новый Структура ("Отбор", Отбор);
	ОткрытьФорму("Справочник.Сотрудники.ФормаСписка"
	            , ПараметрыФормы
				, ПараметрыВыполненияКоманды.Источник
				, "Уволен"
				, ПараметрыВыполненияКоманды.Окно
				, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
