
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.Согласовано = Истина Тогда
		
		Элементы.Дата.Доступность = Ложь;
		Элементы.Номер.Доступность = Ложь;
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.ЦеныКоманднаяПанель.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованоПриИзменении(Элемент)
	
	Если Объект.Согласовано = Истина Тогда
		
		Элементы.Дата.Доступность = Ложь;
		Элементы.Номер.Доступность = Ложь;
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.ЦеныКоманднаяПанель.Доступность = Ложь;
		
	ИначеЕсли Объект.Согласовано = Ложь Тогда
		
		Элементы.Дата.Доступность = Истина;
		Элементы.Номер.Доступность = Истина;
		Элементы.Контрагент.Доступность = Истина;
		Элементы.Ответственный.Доступность = Истина;
		Элементы.Комментарий.Доступность = Истина;
		Элементы.ЦеныКоманднаяПанель.Доступность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры
