
&НаКлиенте
Процедура НаборКонстантВестиРасчетЗарплатыПриИзменении(Элемент)
	Если ВернутьКонстантуВестиРасчетЗарплаты() = Истина Тогда
		 ЗначениеЛожьВестиРасчетЗарплаты();
	 Иначе ЗначениеИстинаВестиРасчетЗарплаты();
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьКонстантуВестиРасчетЗарплаты()
 Возврат Константы.ВестиРасчетЗарплаты.Получить();
КонецФункции

&НаСервереБезКонтекста
Процедура ЗначениеЛожьВестиРасчетЗарплаты()
  Константы.ВестиРасчетЗарплаты.Установить(Ложь);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ЗначениеИстинаВестиРасчетЗарплаты()
  Константы.ВестиРасчетЗарплаты.Установить(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВернутьКонстантуВестиРасчетЗарплаты() = Истина Тогда
		 НаборКонстант.ВестиРасчетЗарплаты = Истина;
	 Иначе НаборКонстант.ВестиРасчетЗарплаты = Ложь;
	КонецЕсли;
КонецПроцедуры


