
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Товары Приход
	Движения.Товары.Записывать = Истина;
	ТЗСвернутая = Товары.Выгрузить();
	ТЗСвернутая.Свернуть("Номенклатура", "Количество");
	
	ТипТовар = Перечисления.ТипыНоменклатуры.Товар;

	Для Каждого ТекСтрокаТовары Из ТЗСвернутая Цикл
		
		Если ТекСтрокаТовары.Номенклатура.ТипНоменклатуры = ТипТовар Тогда
			
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			
		Иначе Сообщить("Услуги на склад не записываются");
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
