
&НаКлиенте
Процедура Сложить(Команда)
	Результат = Результат + Значение;
КонецПроцедуры

&НаКлиенте
Процедура Вычесть(Команда)
	Результат = Результат - Значение;
КонецПроцедуры

&НаКлиенте
Процедура Умножить(Команда)
	Результат = Результат * Значение;
КонецПроцедуры

&НаКлиенте
Процедура Разделить(Команда)
	Результат = Результат / Значение;
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРезультат(Команда)
	Перем ПереносЗначения;
	ПереносЗначения = Результат;
	Результат = Значение;
	Значение = ПереносЗначения;
КонецПроцедуры

&НаКлиенте
Процедура ПамятьПлюс(Команда)
	Память = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ПамятьМинус(Команда)
	Память = Память - Результат;
КонецПроцедуры

&НаКлиенте
Процедура ПамятьЗначение(Команда)
	Память = Значение;
КонецПроцедуры

&НаКлиенте
Процедура ПамятьХ(Команда)
	Память = 0;
КонецПроцедуры
