
Процедура ПередНачаломРаботыСистемы(Отказ)
	ТекстПриветствия = "Привет!";
	//ПредупреждениеАсинх(ТекстПриветствия,  1, "Здравствуйте!");
	Сообщить("Привет, мир!");
	
	ОбновлениеИнформационнойБазыВызовСервера.ПриНачалеРаботыСистемы();
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()  
	
	ДатаСегодня = ТекущаяДата();         
	
	НачалотекущегоДня = НачалоДня(ДатаСегодня);
	ЧасНачалаРаботы = 9;
	МинутыНачалаРаботы = 00;
	Сдвиг = ЧасНачалаРаботы * 60 * 60;
	НачалоРабочегоДня = НачалоТекущегоДня + Сдвиг;
	
	ВремяРаботы = ДатаСегодня - НачалоРабочегоДня;
	
	ДатаСегодняФормат = Формат(ДатаСегодня, "ДФ=dd.MM");
	ВремяРаботыВМинутах = Цел(ВремяРаботы / 60);
	ТекстСообщения = СтрШаблон("Сегодня %1 (минут с начала рабочего дня: %2)", ДатаСегодняФормат, ВремяРаботыВМинутах);
	Сообщить(ТекстСообщения);	
	
	
	// 09.10.2023 Домашнее задание по лекции "Условия"
	
	ТекущаяДата = '20231009100000';
	НомерТекущегоДняНедели = ДеньНедели(ТекущаяДата);
	Если НомерТекущегоДняНедели = 1
		Тогда ТекущийДеньНедели = "понедельник";
		      РабочийНеРабочийДень = "будний день";
	ИначеЕсли НомерТекущегоДняНедели = 2
		Тогда ТекущийДеньНедели = "вторник";
		      РабочийНеРабочийДень = "будний день";
	ИначеЕсли НомерТекущегоДняНедели = 3
		Тогда ТекущийДеньНедели = "среда";
		      РабочийНеРабочийДень = "будний день";
	ИначеЕсли НомерТекущегоДняНедели = 4
		Тогда ТекущийДеньНедели = "четверг";
		      РабочийНеРабочийДень = "будний день";
	ИначеЕсли НомерТекущегоДняНедели = 5
		Тогда ТекущийДеньНедели = "пятница";
		      РабочийНеРабочийДень = "будний день";
	ИначеЕсли НомерТекущегоДняНедели = 6
		Тогда ТекущийДеньНедели = "суббота";
		      РабочийНеРабочийДень = "выходной день";
	ИначеЕсли НомерТекущегоДняНедели = 7
		Тогда ТекущийДеньНедели = "воскресенье";
		      РабочийНеРабочийДень = "выходной день";
	КонецЕсли;     
	
	Часы = Час(ДатаСегодня);
	Минуты = Минута(ДатаСегодня);
	
	Если Часы < 9
		Тогда СостояниеРабочегоВремени = "еще не началось";
	ИначеЕсли Часы >= 9 И Часы < 18
		Тогда СостояниеРабочегоВремени = "идет";
	ИначеЕсли Часы > 18
		Тогда СостояниеРабочегоВремени = "завершилось";
	КонецЕсли;
	
	ТекстСообщенияПоЛекцииУсловия = СтрШаблон("Сегодня %1, %2. Рабочее время %3.", ТекущийДеньНедели, РабочийНеРабочийДень, СостояниеРабочегоВремени);	
	Сообщить(ТекстСообщенияПоЛекцииУсловия);
	                                               
	
		// 19.10.2023 Домашнее задание по лекции "Универсальные коллекции"
		
	ТекущийГод = Год(ТекущаяДата());
	
		ПраздничныеДаты = Новый Массив;   	
	
		Праздник1 = Новый Структура;
	Праздник1.Вставить("Название","Новый год");
	Праздник1.Вставить("Дата", Дата(ТекущийГод, 1, 1));
	ПраздничныеДаты.Добавить(Праздник1); 

		Праздник2 = Новый Структура;
	Праздник2.Вставить("Название","Рождество");
	Праздник2.Вставить("Дата", Дата(ТекущийГод, 1, 7));
	ПраздничныеДаты.Добавить(Праздник2);
	
    	Праздник3 = Новый Структура;
	Праздник3.Вставить("Название","Защитника Отечества");
	Праздник3.Вставить("Дата", Дата(ТекущийГод, 2, 23));
	ПраздничныеДаты.Добавить(Праздник3);
	
    	Праздник4 = Новый Структура;
	Праздник4.Вставить("Название","Международный Женский День");
	Праздник4.Вставить("Дата", Дата(ТекущийГод, 3, 8));
	ПраздничныеДаты.Добавить(Праздник4);
	
    	Праздник5 = Новый Структура;
	Праздник5.Вставить("Название","Праздник Труда");
	Праздник5.Вставить("Дата", Дата(ТекущийГод, 5, 1));
	ПраздничныеДаты.Добавить(Праздник5);
	
    	Праздник6 = Новый Структура;
	Праздник6.Вставить("Название","Победы");
	Праздник6.Вставить("Дата", Дата(ТекущийГод, 5, 9));
	ПраздничныеДаты.Добавить(Праздник6);
	
    	Праздник7 = Новый Структура;
	Праздник7.Вставить("Название","России");
	Праздник7.Вставить("Дата", Дата(ТекущийГод, 6, 12));
	ПраздничныеДаты.Добавить(Праздник7);
	
    	Праздник8 = Новый Структура;
	Праздник8.Вставить("Название","Народного Единства");
	Праздник8.Вставить("Дата", Дата(ТекущийГод, 11, 4));
	ПраздничныеДаты.Добавить(Праздник8);
	
    	Праздник9 = Новый Структура;
	Праздник9.Вставить("Название","самообразования");
	Праздник9.Вставить("Дата", Дата(ТекущийГод, 10, 21));
	ПраздничныеДаты.Добавить(Праздник9);
	
    	Праздник10 = Новый Структура;
	Праздник10.Вставить("Название","видеоигр");
	Праздник10.Вставить("Дата", Дата(ТекущийГод, 10, 22));
	ПраздничныеДаты.Добавить(Праздник10);

	
		Дата = ТекущаяДата(); // для примера '20221231000000'; 
		
		Для Каждого Праздник Из ПраздничныеДаты Цикл
			
			Если Дата >= Праздник.Дата - 86400 И Дата < Праздник.Дата Тогда
		    	Сообщить(СтрШаблон("Поздравляем с наступающим завтра днем %1!", Праздник.Название));
			КонецЕсли; 
			
			Если Дата >= Праздник.Дата И Дата < Праздник.Дата + 86400 Тогда
		    	Сообщить(СтрШаблон("Поздравляем с днем %1!", Праздник.Название));
		    КонецЕсли;

		КонецЦикла;     
		
		
		
		
	// ДЗ по лекции "Процедуры и функции" 27.10.2023
	
	ДеньРождения = СотрудникиВызовСервера.ДеньРожденияТекущегоПользователя();  
	
	Если Число(День(ДеньРождения)) = Число(День(ТекущаяДата())) И Число(Месяц(ДеньРождения)) = Число(Месяц(ТекущаяДата())) Тогда  
		
		Сообщить(СтрШаблон("У вас сегодня День рождения!"))
		
	Иначе Сообщить(СтрШаблон("Скоро у вас День Рождения %1!", ДеньРождения));
		
	КонецЕсли;  
	
КонецПроцедуры	