Процедура УстановкаПараметровСеанса() Экспорт

	ПараметрыСеанса.ВремяНачалаСеанса = ТекущаяДатаСеанса();
	
	// ДЗ по лекции "Процедуры и функции" 27.10.2023
	ИмяТекущегоПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	ПараметрыСеанса.СотрудникТекущегоПользователя = Справочники.Сотрудники.НайтиПоНаименованию(ИмяТекущегоПользователя); 
	//Сообщить(ПараметрыСеанса.СотрудникТекущегоПользователя);

	// Курсовая Diploma-a 16.11.2023
	//Параметр сеанса
	//Создайте параметр сеанса «ТекущийСотрудник» типа «СправочникСсылка.Сотрудники».
	//В модуле сеанса определите процедуру «УстановкаПараметровСеанса».
	//В ней, для простоты не анализируя параметр «ТребуемыеПараметры», найдите сотрудника по значению реквизита «ИдентификаторПользователяИБ», используя функцию менеджера:
	//Справочники.Сотрудники.НайтиПоРеквизиту(<...>);
	//Значение идентификатора получите, обратившись к функции «ТекущийПользователь()» менеджера «ПользователиИнформационнойБазы».

	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПараметрыСеанса.ТекущийСотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);

КонецПроцедуры