
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Дата = Формат(ПараметрыСеанса.ВремяНачалаСеанса, "ДЛФ=DT");
    Ответственный = ПараметрыСеанса.ТекущийСотрудник;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	// регистр Товары/Продажи 
	Движения.Товары.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	ТЗСвернутая = Товары.Выгрузить();
	ТЗСвернутая.Свернуть("Номенклатура", "Количество, Цена, Сумма");
	
	ТипТовар = Перечисления.ТипыНоменклатуры.Товар;
	СотрудникЗаписи = Ответственный;
	
	Для Каждого ТекСтрокаТовары Из ТЗСвернутая Цикл
		
		Если ТекСтрокаТовары.Номенклатура.ТипНоменклатуры = ТипТовар Тогда
			
			// Проверка на Остатки, если не хватает, то выход
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура);
			Остатки = РегистрыНакопления.Товары.Остатки(МоментВремени(), Отбор);
			
			// Проверим, есть ли вообще наличие Номенклатуры на складе
			Если Остатки.Количество() = 0 Тогда
				Сообщить(СтрШаблон("Остатка по Номенклатуре ""%1"" нет"
				         , ТекСтрокаТовары.Номенклатура));
				Отказ = Истина;
				Продолжить;
			КонецЕсли;

			
			// Если остаток есть, то считаем, хватит ли для реализации
			СтрокаОстатка = Остатки[0];
			
			Если СтрокаОстатка.Количество < ТекСтрокаТовары.Количество Тогда
				НеХватаетТовара = ТекСтрокаТовары.Количество - СтрокаОстатка.Количество; 
				Сообщить(СтрШаблон("Не хватает остатка по Номенклатуре ""%1"" с превышением расхода на %2"
				         , ТекСтрокаТовары.Номенклатура, НеХватаетТовара));
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
			
			Если СтрокаОстатка.Количество = ТекСтрокаТовары.Количество Тогда
				СуммаКСписанию = СтрокаОстатка.Сумма;
			Иначе
				СебестоимостьЕдиницыТовара = СтрокаОстатка.Сумма / СтрокаОстатка.Количество;
				СуммаКСписанию = СебестоимостьЕдиницыТовара * ТекСтрокаТовары.Количество;
			КонецЕсли; 
			
			// Проводим
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;            
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Стоимость = ТекСтрокаТовары.Сумма;
			Движение.Сотрудник = СотрудникЗаписи;
			Движение.Сумма = СуммаКСписанию;
		
		КонецЕсли;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;            
		Движение.Сотрудник = СотрудникЗаписи;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
	КонецЦикла;

КонецПроцедуры




