Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт

	ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ПочтовыйАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
	ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	EMailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;

	Выборка = Справочники.Контрагенты.Выбрать();
	Пока Выборка.Следующий() Цикл

		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		КонтрагентОбъект.КонтактнаяИнформация.Очистить();

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьЮридическийАдрес) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ЮридическийАдресКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;
		КонецЕсли;

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьФактическийАдрес) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ФактическийАдресКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьФактическийАдрес;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьПочтовыйАдрес) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ПочтовыйАдресКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьПочтовыйАдрес;
		КонецЕсли;

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьТелефон) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ТелефонКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьТелефон;
		КонецЕсли;

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьEmail) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = EMailКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьEmail;
		КонецЕсли;

		КонтрагентОбъект.Записать();

	КонецЦикла;

КонецПроцедуры