

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Доступность поля КПП при чтении
	Если ТекущийОбъект.ТипКлиента = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Элементы.КПП.Доступность = Ложь;
	КонецЕсли;
	
	// Заполняем невидимый реквизит булево для решение по автоматическому изменению Полного наименования
	// Проверяем, что ПолноеНаименование пусто, если пусто, то ставим флаг "ПроверкаНаИзменениеПолногоНаименования = Истина"
	// То есть мы понимаем, что ПолноеНаименование не заполнялось и мы его можем редактировать
	Если СтрДлина(ТекущийОбъект.ПолноеНаименование) = 0 Тогда
 		  ПроверкаНаИзменениеПолногоНаименования = Истина;
	Иначе ПроверкаНаИзменениеПолногоНаименования = Ложь;
	КонецЕсли;
	  
КонецПроцедуры

&НаКлиенте
Процедура ТипКлиентаПриИзменении(Элемент)
	// Доступность поля КПП при изменении
	Если Объект.ТипКлиента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		Элементы.КПП.Доступность = Истина;
	ИначеЕсли Объект.ТипКлиента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	// Расшифровка сокращении ОПФ
	// Здесь мы проверяем, что флаг "ПроверкаНаИзменениеПолногоНаименования = Истина"
	// Значит ПолноеНаименование не редактировалось и мы можем при изменении Наименования вносить свои корректировки
	Если ПроверкаНаИзменениеПолногоНаименования = Истина Тогда
	 	НаименованиеДлина = СтрДлина(Объект.Наименование);
		Если СтрНайти(Объект.Наименование, "АО ") > 0 Тогда
			Объект.ПолноеНаименование = "Акционерное общество" + Сред(Объект.Наименование, 3, НаименованиеДлина-1);
		ИначеЕсли СтрНайти(Объект.Наименование, "ООО ") > 0 Тогда
			Объект.ПолноеНаименование = "Общество с ограниченной ответственностью" + Сред(Объект.Наименование, 4, НаименованиеДлина-2);
		ИначеЕсли СтрНайти(Объект.Наименование, "ЗАО ") > 0 Тогда
			Объект.ПолноеНаименование = "Закрытое акционерное общество" + Сред(Объект.Наименование, 4, НаименованиеДлина-2);
		ИначеЕсли СтрНайти(Объект.Наименование, "ОАО ") > 0 Тогда
			Объект.ПолноеНаименование = "Открытое акционерное общество" + Сред(Объект.Наименование, 4, НаименованиеДлина-2);
		ИначеЕсли СтрНайти(Объект.Наименование, "ХО ") > 0 Тогда
			Объект.ПолноеНаименование = "Хозяйственное общество" + Сред(Объект.Наименование, 3, НаименованиеДлина-1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполняем невидимый реквизит булево для решение по автоматическому изменению Полного наименования
	// Проверяем, что ПолноеНаименование пусто, если пусто, то ставим флаг "ПроверкаНаИзменениеПолногоНаименования = Истина"
	// То есть мы понимаем, что ПолноеНаименование не заполнялось и мы его можем редактировать
	Если СтрДлина(Объект.ПолноеНаименование) = 0 Тогда
 		  ПроверкаНаИзменениеПолногоНаименования = Истина;
	Иначе ПроверкаНаИзменениеПолногоНаименования = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СписокКонтактныхЛицНаСервере()
	
	Выборка = Справочники.КонтактныеЛица.Выбрать(,Объект.Ссылка);
	
	Пока Выборка.Следующий() Цикл
		
		Текст = СтрШаблон("%1. Должность: %2. Телефон: %3", Выборка.Наименование, Выборка.Должность, Выборка.Телефон);
		Сообщить(Текст);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтактныхЛиц(Команда)
	СписокКонтактныхЛицНаСервере();
КонецПроцедуры











