
&НаСервере
Процедура ПересчитатьДокументыНаСервере()
	
	Запрос = Новый Запрос;

	// Ищем ссылки на документы запросом
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
				   |ГДЕ
				   |	ПоступлениеТоваровИУслуг.Дата МЕЖДУ &ДатаНачалаПериода И &ДатаЗавершенияПериода";
	Запрос.УстановитьПараметр("ДатаНачалаПериода", Объект.ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаЗавершенияПериода", Объект.ДатаЗавершенияПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перебираем Таблицу Товары в найденых документах
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
			СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		КонецЦикла;
		
		// Сохраняем
		ДокументОбъект.Записать();		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Для проверки решения по заданию NewModules/SID/3_ConfigUpdate.md (Задача 4) 
// отключил пересчет Суммы "Документы - ПоступлениеТоваровИУслуг - Товары - Сумма"
Процедура ПересчитатьДокументы(Команда)
	ПересчитатьДокументыНаСервере();
КонецПроцедуры
