Функция  ИННВерен(ПроверкаИНН) Экспорт
	
	Если СтрДлина(ПроверкаИНН) = 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрДлина(ПроверкаИНН) = 10 Тогда
		Разряд1 = Число(Сред(ПроверкаИНН,1,1));
		Разряд2 = Число(Сред(ПроверкаИНН,2,1));
		Разряд3 = Число(Сред(ПроверкаИНН,3,1));
		Разряд4 = Число(Сред(ПроверкаИНН,4,1));
		Разряд5 = Число(Сред(ПроверкаИНН,5,1));
		Разряд6 = Число(Сред(ПроверкаИНН,6,1));
		Разряд7 = Число(Сред(ПроверкаИНН,7,1));
		Разряд8 = Число(Сред(ПроверкаИНН,8,1));
		Разряд9 = Число(Сред(ПроверкаИНН,9,1));
		Разряд10 = Число(Сред(ПроверкаИНН,10,1));
		
		РасчетСуммы = (Разряд1 * 2) + (Разряд2 * 4) + (Разряд3 * 10) + (Разряд4 * 3) +
		         	  (Разряд5 * 5) + (Разряд6 * 9) + (Разряд7 * 4) + (Разряд8 * 6) +
					  (Разряд9 * 8);  
					  
		РасчетнаяСуммаПересчет = Цел(Цел((РасчетСуммы / 11)) * 11);
		
		РасчетКлюча = РасчетСуммы - РасчетнаяСуммаПересчет;
			Если РасчетКлюча < 0
				Тогда КонтрольныйРазряд10 = РасчетКлюча * (-1);
			Иначе КонтрольныйРазряд10 = РасчетКлюча;
			КонецЕсли;  
			
			Если  Разряд10 - КонтрольныйРазряд10 = 0 Тогда
				  Возврат Истина;
			Иначе Возврат Ложь;
			КонецЕсли;  
			
		ИначеЕсли СтрДлина(ПроверкаИНН) = 12 Тогда  
			      Возврат Истина;
	КонецЕсли;  
	
	
	
КонецФункции


Функция  ПроверкаИННСВыводом(ПроверкаИНН) Экспорт 
	                                  
	Если СтрДлина(ПроверкаИНН) = 10 Тогда
		Разряд1 = Число(Сред(ПроверкаИНН,1,1));
		Разряд2 = Число(Сред(ПроверкаИНН,2,1));
		Разряд3 = Число(Сред(ПроверкаИНН,3,1));
		Разряд4 = Число(Сред(ПроверкаИНН,4,1));
		Разряд5 = Число(Сред(ПроверкаИНН,5,1));
		Разряд6 = Число(Сред(ПроверкаИНН,6,1));
		Разряд7 = Число(Сред(ПроверкаИНН,7,1));
		Разряд8 = Число(Сред(ПроверкаИНН,8,1));
		Разряд9 = Число(Сред(ПроверкаИНН,9,1));
		Разряд10 = Число(Сред(ПроверкаИНН,10,1));
		
		РасчетСуммы = (Разряд1 * 2) + (Разряд2 * 4) + (Разряд3 * 10) + (Разряд4 * 3) +
		         	  (Разряд5 * 5) + (Разряд6 * 9) + (Разряд7 * 4) + (Разряд8 * 6) +
					  (Разряд9 * 8);  
					  
		РасчетнаяСуммаПересчет = Цел(Цел((РасчетСуммы / 11)) * 11);
		
		РасчетКлюча = РасчетСуммы - РасчетнаяСуммаПересчет;
			Если РасчетКлюча < 0
				Тогда КонтрольныйРазряд10 = РасчетКлюча * (-1);
			Иначе КонтрольныйРазряд10 = РасчетКлюча;
			КонецЕсли;  
			
			Если  Разряд10 - КонтрольныйРазряд10 <> 0 Тогда
				 Возврат СтрШаблон("Не пройден контроль 10го ""%1"" символа", Разряд10);
			КонецЕсли;  
			
		ИначеЕсли СтрДлина(ПроверкаИНН) = 12 Тогда
			
		Разряд1 = Число(Сред(ПроверкаИНН,1,1));
		Разряд2 = Число(Сред(ПроверкаИНН,2,1));
		Разряд3 = Число(Сред(ПроверкаИНН,3,1));
		Разряд4 = Число(Сред(ПроверкаИНН,4,1));
		Разряд5 = Число(Сред(ПроверкаИНН,5,1));
		Разряд6 = Число(Сред(ПроверкаИНН,6,1));
		Разряд7 = Число(Сред(ПроверкаИНН,7,1));
		Разряд8 = Число(Сред(ПроверкаИНН,8,1));
		Разряд9 = Число(Сред(ПроверкаИНН,9,1));
		Разряд10 = Число(Сред(ПроверкаИНН,10,1));
		Разряд11 = Число(Сред(ПроверкаИНН,11,1));
		Разряд12 = Число(Сред(ПроверкаИНН,12,1));
		
		                    
		РасчетСуммы11 = (Разряд1 * 7) + (Разряд2 * 2) + (Разряд3 * 4) + (Разряд4 * 10) +
		         	    (Разряд5 * 3) + (Разряд6 * 5) + (Разряд7 * 9) + (Разряд8 * 4) +
					    (Разряд9 * 6) + (Разряд10 * 8);
		РасчетСуммы12 = (Разряд1 * 3) + (Разряд2 * 7) + (Разряд3 * 2) + (Разряд4 * 4) +
		         	    (Разряд5 * 10) + (Разряд6 * 3) + (Разряд7 * 5) + (Разряд8 * 9) +
					    (Разряд9 * 4) + (Разряд10 * 6) + (Разряд11 * 8);  
					  
		РасчетнаяСуммаПересчет11 = Цел(Цел((РасчетСуммы11 / 11)) * 11);
		РасчетнаяСуммаПересчет12 = Цел(Цел((РасчетСуммы12 / 11)) * 11); 
		//Возврат СтрШаблон("РасчетнаяСуммаПересчет11 = %1, РасчетнаяСуммаПересчет12 = %2", РасчетнаяСуммаПересчет11, РасчетнаяСуммаПересчет12);
		
		РасчетКлюча11 = РасчетСуммы11 - РасчетнаяСуммаПересчет11;
		РасчетКлюча12 = РасчетСуммы12 - РасчетнаяСуммаПересчет12;
			Если РасчетКлюча11 < 0
				Тогда КонтрольныйРазряд11 = РасчетКлюча11 * (-1);
			Иначе КонтрольныйРазряд11 = РасчетКлюча11;
			КонецЕсли;  
			
			Если  Разряд11 - КонтрольныйРазряд11 <> 0 Тогда 
				 Возврат СтрШаблон("Не пройден контроль 11го ""%1"" символа", Разряд11);
			КонецЕсли;
			
			Если РасчетКлюча12 < 0
				Тогда КонтрольныйРазряд12 = РасчетКлюча12 * (-1);
			Иначе КонтрольныйРазряд12 = РасчетКлюча12;
			КонецЕсли;  
			
			Если  Разряд12 - КонтрольныйРазряд12 <> 0 Тогда 
				 Возврат СтрШаблон("Не пройден контроль 12го ""%1"" символа", Разряд12);				  
			КонецЕсли; 
	КонецЕсли;  
	
	
	
КонецФункции